# "" – do nothing
# "a:b:c" - generate quantitive variable with such proportions of answers
# "a:b=x;c:d=y" - generate qualitive data and give certain prob to a factor 
#       "a<1.0:b=c" for continuous FIRST

# Check whether numeration is from 1 everywhere 
expected_corrs_vector = c("национальность", "планы на будущее", "",
                          "национальность", "религия", "",
                          "национальность", "создание семьи", "",
                          "национальность", "получение гражданства", "",
                          "национальность", "диаспоральность", "1.5:1:2",
                          "национальность", "знание языка", "",
                          "национальность", "общение и досуг", "1:1:2",
                          "национальность", "этноцентричность", "1:2:2.5",
                          "срок проживания в РФ", "знание языка", "+",
                          "срок проживания в РФ", "планы на будущее", "2:1=0.3;1:5=0.4",
                          "срок проживания в РФ", "диаспоральность", "-",
                          "срок проживания в РФ", "общение и досуг", "+",
                          "срок проживания в РФ", "способ решения проблем", "2:4=0.2;2:5=0.2;0:1=0.5",
                          "этноцентричность", "общение и досуг", "-",
                          "этноцентричность", "получение гражданства", "-",
                          "этноцентричность", "религиозность", "+",
                          "этноцентричность", "планы на будущее", "0.7:2",
                          "этноцентричность", "диаспоральность", "+",
                          "этноцентричность", "способ решения проблем", "0.6:1=0.7;0.8:2=0.3",
                          "этноцентричность", "создание семьи", "-",
                          "социальная проблемность", "диаспоральность", "+",
                          "социальная проблемность", "способ решения проблем", "0.5:5=-0.5",
                          "социальная проблемность", "планы на будущее", "0.3:5=0.5;0.6:3=0.5",
                          "социальная проблемность", "информированность", "-",
                          "социальная проблемность", "общение и досуг", "-",
                          "диаспоральность", "общение и досуг", "-",
                          "диаспоральность", "способ решения проблем", "0.4:1=0.9;0.6:2=0.3",
                          "диаспоральность", "информированность", "+",
                          "диаспоральность", "создание семьи", "-",
                          "религия", "диаспоральность", "1:1:0",
                          "религия", "общение и досуг", "-1:1:0",
                          "религия", "создание семьи", "-1:0:0",
                          "образование","знание языка", "+",
                          "образование","место жительства", "2+:1=0.1",
                          "образование","общение и досуг", "+",
                          "образование","создание семьи", "+",
                          "образование","планы на будущее", "2+:2=0.3;4+:1=0.2",
                          "образование","информированность", "+",
                          "образование","способ решения проблем", "2+:3=0.2;2+:4=0.3;2+:5=0.5;3+:6=0.2"
                          # Нуждается в проверке
                          # "советскость"
                          # suddenly came in mind while typing
                          #"религия", "религиозность"
)
expected_corrs_matrix = matrix(expected_corrs_vector, ncol=3, byrow = TRUE)


expected_corrs_named_vector = expected_corrs_matrix[,2]
names(expected_corrs_named_vector) = expected_corrs_matrix[,1]
